# Fictional Army - Filtering and Sorting

### Import libraries

In [6]:
import numpy as np
import pandas as pd

### Step 1. This is the data given as a dictionary. Create a dataframe and assign it to a variable called army.

In [7]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, None, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, None, 3, None, 2, None, 2, None, None, 1, 2, None],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

army = pd.DataFrame(raw_data)

NameError: name 'insull' is not defined

### Step 2. Check missing values

In [8]:

tiene_nan = army.isnull().values.view()

print( tiene_nan)

[[False False False False False False False False False False]
 [False False False False False False  True False False False]
 [False False False False False False False False False False]
 [False False False False False False  True False False False]
 [False False False False False False False False False False]
 [False False False False False False  True False False False]
 [False False False False False False False False False False]
 [False False False False False False  True False False False]
 [False False  True False False False  True False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False  True False False False]]

### Step 3. Drop features, if there are more than 30% missing values.

In [9]:
# Ver cuántos valores faltantes hay por columna
nulos_por_columna = army.isnull().sum()
print("\nValores faltantes por columna:")
print(nulos_por_columna)

# Mostrar filas que contienen al menos un valor nulo
filas_con_nulos = army[army.isnull().any(axis=1)]
filas_con_nulos


umbral = len(army) * 0.3  # 30% de las filas

# Eliminar columnas con más del 30% de valores nulos
army_filtrado = army.dropna(axis=1, thresh=army.shape[0] - umbral)

print("Columnas después de eliminar las que tienen más del 30% de nulos:")
print(army_filtrado.columns.tolist())

Valores faltantes por columna:
regiment     0
company      0
deaths       1
battles      0
size         0
veterans     0
readiness    6
armored      0
deserters    0
origin       0
dtype: int64
Columnas después de eliminar las que tienen más del 30% de nulos:
['regiment', 'company', 'deaths', 'battles', 'size', 'veterans', 'armored', 'deserters', 'origin']

### Step 4. Fill missing values with the mean of their regiment.

In [ ]:
# army["deaths"] = army.groupby("regiment")["deaths"].transform(lambda val: val.fillna(val.mean()))
# army

army["deaths"] = army["deaths"] ..

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523.000000,5,1045,1,1.0,1,4,Arizona
1,Nighthawks,1st,52.000000,42,957,5,NaN,0,24,California
2,Nighthawks,2nd,25.000000,2,1099,62,3.0,1,31,Texas
3,Nighthawks,2nd,616.000000,2,1400,26,NaN,1,2,Florida
4,Dragoons,1st,43.000000,4,1592,73,2.0,0,3,Maine
5,Dragoons,1st,234.000000,7,1006,37,NaN,1,4,Iowa
6,Dragoons,2nd,523.000000,8,987,949,2.0,0,24,Alaska
7,Dragoons,2nd,62.000000,3,849,48,NaN,1,31,Washington
8,Scouts,1st,48.333333,4,973,48,NaN,0,2,Oregon
9,Scouts,1st,73.000000,7,1005,435,1.0,0,3,Wyoming
10,Scouts,2nd,37.000000,8,1099,63,2.0,1,2,Louisana
11,Scouts,2nd,35.000000,9,1523,345,NaN,1,3,Georgia

### Step 5. Set the 'origin' colum as the index of the dataframe

In [12]:
army = army.set_index("origin")
army

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.000000,5,1045,1,1.0,1,4
California,Nighthawks,1st,52.000000,42,957,5,NaN,0,24
Texas,Nighthawks,2nd,25.000000,2,1099,62,3.0,1,31
Florida,Nighthawks,2nd,616.000000,2,1400,26,NaN,1,2
Maine,Dragoons,1st,43.000000,4,1592,73,2.0,0,3
Iowa,Dragoons,1st,234.000000,7,1006,37,NaN,1,4
Alaska,Dragoons,2nd,523.000000,8,987,949,2.0,0,24
Washington,Dragoons,2nd,62.000000,3,849,48,NaN,1,31
Oregon,Scouts,1st,48.333333,4,973,48,NaN,0,2
Wyoming,Scouts,1st,73.000000,7,1005,435,1.0,0,3
Louisana,Scouts,2nd,37.000000,8,1099,63,2.0,1,2
Georgia,Scouts,2nd,35.000000,9,1523,345,NaN,1,3

### Step 6. Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [13]:
army.loc[["Maine","Alaska"]][["deaths","size","deserters"]]

        deaths  size  deserters
origin
Maine     43.0  1592          3
Alaska   523.0   987         24

### Step 7. Select the rows 3 to 7 and the columns 3 to 6

In [14]:
army.iloc[2:7,2:6]

         deaths  battles  size  veterans
origin
Texas      25.0        2  1099        62
Florida   616.0        2  1400        26
Maine      43.0        4  1592        73
Iowa      234.0        7  1006        37
Alaska    523.0        8   987       949

### Step 8. Select every row after the fourth row and all columns

In [ ]:
army.iloc[3:,:]

### Step 9. Select every row up to the 4th row and all columns

In [ ]:
army.iloc

### Step 10. Select the 3rd column up to the 7th column

### Step 11. Select rows where df.deaths is greater than 50

### Step 12. Select rows where df.deaths is greater than 500 or less than 50

### Step 13. Select all the regiments not named "Dragoons"

### Step 14. Select the rows called Texas and Arizona

### Step 15. Select the third cell in the row named Arizona

### Step 16. Select the third cell down in the column named deaths